n = 4  # количество вершин

# 1. Матрица смежности
adj_matrix = [
    [0, 1, 1, 0],
    [0, 0, 0, 1],
    [0, 0, 0, 1],
    [1, 0, 0, 0]
]

# 2. Матрица инцидентности
# столбцы = дуги:
# (1,2), (1,3), (2,4), (3,4), (4,1)

inc_matrix = [
# e1 e2 e3 e4 e5
[-1,-1, 0, 0, 1],   # вершина 1
[ 1, 0,-1, 0, 0],   # вершина 2
[ 0, 1, 0,-1, 0],   # вершина 3
[ 0, 0, 1, 1,-1]    # вершина 4
]

# 3. Список смежности
adj_list = {
    1: [2, 3],
    2: [4],
    3: [4],
    4: [1]
}

# 4. Список дуг
edge_list = [
    (1, 2),
    (1, 3),
    (2, 4),
    (3, 4),
    (4, 1)
]

# 5. Упорядоченный список дуг
ordered_edge_list = sorted(edge_list)
